       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLOWORLD.
      *
       ENVIRONMENT DIVISION.
      *
       DATA DIVISION.
      *
       PROCEDURE DIVISION.
      *
       MAIN SECTION.
      *
          DISPLAY "HELLO WORLD".
      *
       PROG-EX.
           EXIT PROGRAM.
      *
       END PROGRAM HELLOWORLD.
