       IDENTIFICATION DIVISION.
       PROGRAM-ID. VARIABLES.
      *
      *
       ENVIRONMENT DIVISION.
      * 
       DATA DIVISION.
      *
       PROCEDURE DIVISION.
      *
       MAIN SECTION.
      *
           DISPLAY 1234.
      *
       PROG-EX.
           EXIT PROGRAM.
      *
       END PROGRAM VARIABLES.
