       IDENTIFICATION DIVISION.
       PROGRAM-ID. MULTIPLECALLSAMEPROGRAM.
      *
       ENVIRONMENT DIVISION.
      *
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       COPY BASICDEFINITIONS.
      *
       PROCEDURE DIVISION.
      *
       MAIN SECTION.
      *
          DISPLAY COPY-STRING.
          DISPLAY COPY-NUMBER.

          CALL MULTIPLECALLSAMEPROGRAMCALLED USING BASIC-DEFINITIONS.
          DISPLAY COPY-STRING.
          DISPLAY COPY-NUMBER.

          CALL MULTIPLECALLSAMEPROGRAMCALLED USING BASIC-DEFINITIONS.
          DISPLAY COPY-STRING.
          DISPLAY COPY-NUMBER.

          MOVE "MAIN MAIN" TO COPY-STRING.
          MOVE "99999999"    TO COPY-NUMBER.
          DISPLAY COPY-STRING.
          DISPLAY COPY-NUMBER.

          CALL MULTIPLECALLSAMEPROGRAMCALLED USING BASIC-DEFINITIONS.
          DISPLAY COPY-STRING.
          DISPLAY COPY-NUMBER.
      *
       PROG-EX.
           EXIT PROGRAM.
      *
       END PROGRAM  MULTIPLECALLSAMEPROGRAM.
