       IDENTIFICATION DIVISION.
       PROGRAM-ID. SIMPLECALL.
      *
       ENVIRONMENT DIVISION.
      *
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       COPY BASICDEFINITIONS.
      *
       PROCEDURE DIVISION.
      *
       MAIN SECTION.
      *
          DISPLAY COPY-STRING.
          DISPLAY COPY-NUMBER.
          CALL SIMPLECALLED USING BASIC-DEFINITIONS.
          DISPLAY COPY-STRING.
          DISPLAY COPY-NUMBER.
      *
       PROG-EX.
           EXIT PROGRAM.
      *
       END PROGRAM SIMPLECALL.
