       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLOWORLD.
      *
      *
       ENVIRONMENT DIVISION.
      * 
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       LINKAGE SECTION.
      *
       PROCEDURE DIVISION.
      *
       MAIN SECTION.
      *
           DISPLAY "HELLO WORLD".
      *
       PROG-EX.
           EXIT PROGRAM.
      *
       END PROGRAM TEST.
